Revit 2027 API
RoutingPreferenceRule.RemoveCriteron Method
 Removes an existing criterion.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveCriteron(
	int index
)
Public Sub RemoveCriteron (
	index As Integer
)
public:
void RemoveCriteron(
	int index
)
member RemoveCriteron :
        index : int -> unit
Parameters
index Int32
 The index position of removed routing preference rule in the group.
Exceptions
Exception | Condition
ArgumentException |  index is not a valid zero-based index. -or- Thrown if the index is out of bounds.
See Also
Reference
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace